app/controllers/moods_controller.rb

  def index
    @users = User.users_with_moods
    @moods = @users.map { |user| user.current_mood }
---
SELECT  "moods".* FROM "moods"  WHERE "moods"."user_id" = ?  ORDER BY created_at DESC LIMIT 1  [["user_id", 1]]

  def create
    user = User.friendly.find(params[:user_slug])

    mood = user.moods.new
    mood.left = params[:mood][:left]
    mood.top = params[:mood][:top]
    mood.status = params[:status]
    mood.save!
---
SELECT  "users".* FROM "users"  WHERE "users"."slug" = 'landon-alder'  ORDER BY "users"."id" ASC LIMIT 1
INSERT INTO "moods" ("created_at", "left", "status", "top", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2015-08-19 22:42:19.390430"], ["left", 765], ["status", "No status set"], ["top", 91], ["updated_at", "2015-08-19 22:42:19.390430"], ["user_id", 1]]