app/controllers/users_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."slug" = 'landon-alder'  ORDER BY "users"."id" ASC LIMIT 1
---
  def edit
    @user = User.friendly.find(params[:slug])

SELECT  "users".* FROM "users"  WHERE "users"."slug" = 'landon-alder'  ORDER BY "users"."id" ASC LIMIT 1
UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["email", "landon.klejwr@nordstrom.com"], ["updated_at", "2015-08-26 21:09:38.185238"]]
---
  def update
    user = User.friendly.find(params[:slug])

    user.email = params[:user][:email]
    user.save!

SELECT  "users".* FROM "users"  WHERE "users"."slug" = 'landon-alder'  ORDER BY "users"."id" ASC LIMIT 1
---
  def show
    @user = User.friendly.find(params[:slug])